InformationRegisters/УчетнаяПолитикаНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаНалоговыйУчет</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НДСНалоговыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСМетодОтнесенияВЗачет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОтнесенияНДСВЗачет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизацияЯвляетсяПлательщикомНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизацияЯвляетсяПлательщикомКПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизацияЯвляетсяПлательщикомАкциза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизацияЯвляетсяПлательщикомСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпрощенныйУчетИПНиОПВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеПоПериодуРегистрации</Name>
					<Comment>Используется для расчета ИПН, ОПВ, СН и СО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗасчитыватьВВыплаченныеДоходыУдержанияПоИЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьОграничениеНаМинимальнуюБазуСоциальногоНалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокСписанияЗадолженностиПоЗарплате</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокСписанияЗадолженностиПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспределятьНалогиПоСтруктурнымЕдиницам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаспределятьНалогиПоПодразделениямОрганизаций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизацияЯвляетсяВкладчикомОППВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьОграничениеНаМинимальныйОбъектОСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕжемесячныйРасчетВзносовИОтчисленийЗаИП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРасчетаДоходаОПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетаДоходовЗаИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерДоходаОПВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРасчетаДоходаСО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетаДоходовЗаИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерДоходаСО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоставлятьВычетВМесяцеОтсутствияДохода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияОПВИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияСОИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаВОСМСДляИП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВОСМСИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерДоходаВОСМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРасчетаДоходаВОСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРасчетаДоходовЗаИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьВычетВОСМСДляФизическихЛицИГПХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаОПВдляИП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаСОДляИП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьВычетОПВиВОСМСДляГПХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОбложенияДоходовРаботников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОбложенияДоходовРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗаявленногоДоходаИП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаОПВРдляИП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияОПВРИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РежимНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>РежимНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Патент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйВычет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общеустановленный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничныйНалог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/УчетнаяПолитикаНалоговыйУчет/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает список всех используемых в информационной базе систем налогообложения
//
// Параметры:
//  ВидОрганизации         - Строка - имя вида организации
//  СистемаНалогообложения - Строка - имя системы налогообложения
//
// Возвращаемое значение:
//  Структура - где ключ - имя ресурса регистра УчетнаяПолитикаНалоговыйУчет
//
Функция СтруктураУчетнойПолитики(ВидОрганизации, СистемаНалогообложения) Экспорт
	
	СтруктураУчетнойПолитики = Новый Структура;
	
	Если СистемаНалогообложения = "Патент" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.Патент);
		
	ИначеЕсли СистемаНалогообложения = "УпрощеннаяДекларация" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Ложь);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.УпрощеннаяДекларация);
		
	ИначеЕсли СистемаНалогообложения = "ФиксированныйВычет" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.ФиксированныйВычет); 
		
	ИначеЕсли СистемаНалогообложения = "РозничныйНалог" Тогда
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Ложь);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Ложь);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.РозничныйНалог);
		
	Иначе
		
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомСН",  Истина);
		СтруктураУчетнойПолитики.Вставить("ОрганизацияЯвляетсяПлательщикомКПН", Истина);
		СтруктураУчетнойПолитики.Вставить("РежимНалогообложения",               Перечисления.РежимНалогообложения.Общеустановленный);
		
	КонецЕсли;
	
	Возврат СтруктураУчетнойПолитики;
	
КонецФункции 

Функция ПолучитьФилиалыГоловнойОрганизации(ГоловнаяОрганизация) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.Ссылка = &Организация
	|	И Организации.ГоловнаяОрганизация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", ГоловнаяОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	СписокФилиалов = Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СписокФилиалов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);		
		
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СписокФилиалов;
		
КонецФункции 

Функция ПолучитьПорядокОбложенияДоходовРаботниковПоОрганизациям(Организация, Период) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников,
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаНалоговыйУчет.СрезПоследних(&ПериодПо, Организация В (&Организации)) КАК УчетнаяПолитикаНалоговыйУчетСрезПоследних
	|ГДЕ
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Период >= ДАТАВРЕМЯ(2023, 1, 1)";

	Запрос.УстановитьПараметр("ПериодПо", КонецДня(Период));
	
	Если ТипЗнч(Организация) <> Тип("СписокЗначений") Тогда
		СписокОрганизаций = Новый СписокЗначений;
		СписокОрганизаций.Добавить(Организация);
		
		Запрос.УстановитьПараметр("Организации", СписокОрганизаций);
	Иначе	
		Запрос.УстановитьПараметр("Организации", Организация);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);  
	
	Если ТипЗнч(Организация) <> Тип("СписокЗначений") Тогда 
			
		Если Выборка.Следующий() Тогда
			ПорядокОбложенияДоходовРаботников = Выборка.ПорядокОбложенияДоходовРаботников;
		Иначе
			ПорядокОбложенияДоходовРаботников = Неопределено;
		КонецЕсли; 
			
	Иначе  
		
		ПорядокОбложенияДоходовРаботников = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			ПорядокОбложенияДоходовРаботниковСтруктура = Новый Структура;
			
			ПорядокОбложенияДоходовРаботниковСтруктура.Вставить("Организация", Выборка.Организация);
			ПорядокОбложенияДоходовРаботниковСтруктура.Вставить("ПорядокОбложенияДоходовРаботников", Выборка.ПорядокОбложенияДоходовРаботников);
			
			ПорядокОбложенияДоходовРаботников.Добавить(ПорядокОбложенияДоходовРаботниковСтруктура);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПорядокОбложенияДоходовРаботников;
	
КонецФункции
	
#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
	
#Область ОбработчикиОбновления

Процедура ЗаполнитьПорядокОбложенияДоходовРаботниковФилиалов() Экспорт
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Организация КАК Филиал,
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Период КАК ФилиалПериод,
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Организация.ГоловнаяОрганизация КАК ФилиалГоловнаяОрганизация,
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.ПорядокОбложенияДоходовРаботников КАК ФилиалПорядокОбложенияДоходовРаботников
	|ПОМЕСТИТЬ ВТ_Филиалы
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаНалоговыйУчет.СрезПоследних(, Организация <> Организация.ГоловнаяОрганизация) КАК УчетнаяПолитикаНалоговыйУчетСрезПоследних
	|ГДЕ
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Период >= ДАТАВРЕМЯ(2023, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Филиалы.Филиал КАК Филиал,
	|	ВТ_Филиалы.ФилиалПериод КАК ФилиалПериод,
	|	ВТ_Филиалы.ФилиалГоловнаяОрганизация КАК ФилиалГоловнаяОрганизация,
	|	ВТ_Филиалы.ФилиалПорядокОбложенияДоходовРаботников КАК ФилиалПорядокОбложенияДоходовРаботников,
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Период КАК ГоловнаяОрганизацияПериод,
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Организация КАК ГоловнаяОрганизация,
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.ПорядокОбложенияДоходовРаботников КАК ГоловнаяОрганизацияПорядокОбложенияДоходовРаботников
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаНалоговыйУчет.СрезПоследних КАК УчетнаяПолитикаНалоговыйУчетСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Филиалы КАК ВТ_Филиалы
	|		ПО УчетнаяПолитикаНалоговыйУчетСрезПоследних.Организация = ВТ_Филиалы.ФилиалГоловнаяОрганизация
	|ГДЕ
	|	УчетнаяПолитикаНалоговыйУчетСрезПоследних.Период >= ДАТАВРЕМЯ(2023, 1, 1)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаНалоговыйУчет.СоздатьНаборЗаписей();
	
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Филиал);
        НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.ФилиалПериод);
        
        НаборЗаписей.Прочитать();
        
        Если НЕ НаборЗаписей.Количество() = 0 Тогда
            
            Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
                ЗаписьНабора.ПорядокОбложенияДоходовРаботников = ВыборкаДетальныеЗаписи.ГоловнаяОрганизацияПорядокОбложенияДоходовРаботников;
            КонецЦикла;
            
        КонецЕсли;
        
		Если НЕ НаборЗаписей.Количество() = 0 Тогда  
            
            Попытка
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
                НаборЗаписей.Записать(); 	
            Исключение
                ТекстСообщения = НСтр("ru='Операция не выполнена'");
                ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
            КонецПопытки;
            
        КонецЕсли;
        
    КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
